package resources

const (
	TXTStart                    = "<b>%v</b>. Выберите действие:"
	TXTViewTasks                = "<b>%v</b> выберите фильтр для задач:"
	TXTAddTask                  = "<b>%v</b> введите описание задачи и дедлайн в формате:\nВыполнить 1 пункт 01.01.2025 01:00"
	TXTAddTaskTemplate          = "Выполнить 1 пункт ТЗ 01.01.2025 01:00"
	TXTSaveTask                 = "Задача успешно добавлена"
	TXTFilterAll                = "<b>%v</b> вы просматриваете все имеющиеся задачи:"
	TXTFilterCompleted          = "<b>%v</b> вы просматриваете все имеющиеся задачи в статусе <b>Выполнено</b>:"
	TXTFilterOverdue            = "<b>%v</b> вы просматриваете все имеющиеся задачи в статусе <b>Просрочено</b>:"
	TXTFilterClosed             = "<b>%v</b> вы просматриваете все имеющиеся задачи в статусе <b>Завершено</b>:"
	TXTFilterInProgress         = "<b>%v</b> вы просматриваете все имеющиеся задачи в статусе <b>В процессе</b>:"
	TXTDeleteTask               = "<b>%v</b> выберите задачу для удаления:"
	TXTCompletedTaskByIdCommand = "<b>%v</b> здесь нужно добавить соответствующий текст:"
	TXTClosedTaskByIdCommand    = "<b>%v</b> здесь нужно добавить соответствующий текст:"
	TXTDeleteTaskByIdCommand    = "<b>%v</b> здесь нужно добавить соответствующий текст:"
	TXTEditTask                 = "<b>%v</b> выберите задачу для редактирования:"
	TXTEditTaskByIdCommand      = "<b>%v</b> здесь нужно добавить соответствующий текст:"
	TXTCompletedTask            = "<b>%v</b> выберите задачу для пометки <b>Выполнено</b>:"
	TXTClosedTask               = "<b>%v</b> выберите задачу для пометки <b>Завершено</b>:"
	TXTUpdateTask               = "Задача успешно обновлена"
	TXTUnknownCommand           = "К сожалению, данная команда мне неизвестна. Для начала работы введите /start"
)
